app/controllers/renderers_controller.rb

  def index
    @renderers = Renderer.all
---
SELECT * FROM `renderers`

  def show
    @renderer = Renderer.find(params[:id])
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)

  def edit
    @renderer = Renderer.find(params[:id])
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)

  def create
    @renderer = Renderer.new(params[:renderer])

    respond_to do |format|
      if @renderer.save
---
INSERT INTO `renderers` (`created_at`, `title`, `updated_at`, `mappings`, `description`) VALUES('2011-05-26 11:02:51', NULL, '2011-05-26 11:02:51', NULL, NULL)

  def update
    @renderer = Renderer.find(params[:id])

    respond_to do |format|
      if @renderer.update_attributes(params[:renderer])
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)
UPDATE `renderers` SET `mappings` = '--- \n- :items: \n - :input: \"\"\n :decorations: []\n\n :placeholder: username\n - :input: \"\"\n :decorations: []\n\n :placeholder: titolo\n :template: <div class=\"titolo\">{username} {titolo}</div>\n- :items: \n - :input: \"\"\n :decorations: []\n\n :placeholder: paragrafo\n :template: <p>{paragrafo}</p>\n' WHERE `id` = 1

  def add_mapping
    @renderer = Renderer.find params[:id]
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)

  def remove_mapping
    @renderer = Renderer.find params[:id]
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)

  def update_template_code
    @renderer = Renderer.find params[:id]
    @position = params[:position].to_i
    @mapping = @renderer.get_mappings[@position]
    @mapping.template= Template.new %Q{#{params[:template]}}
    @renderer.mappings[@position] = @mapping.dump
    @renderer.save
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)
UPDATE `renderers` SET `mappings` = '--- \n- :items: []\n\n :template: <div class=\"titolo\">{username}</div>\n- :items: []\n\n :template: \"\"\n' WHERE `id` = 1

  def update_mapping_item
    @renderer = Renderer.find params[:id]
    @position = params[:position].to_i
    @mapping = @renderer.get_mappings[@position]
    @item = @mapping.get_item_for_placeholder_if_exists_or_create_it params[:placeholder]
    @item.input = params[:input] unless params[:input].nil?
    @renderer.mappings[@position] = @mapping.dump
    @renderer.save
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)
UPDATE `renderers` SET `mappings` = '--- \n- :items: \n - :input: \"\"\n :decorations: []\n\n :placeholder: username\n :template: <div class=\"titolo\">{username} {titolo}</div>\n- :items: []\n\n :template: <p>{paragrafo}</p>\n' WHERE `id` = 1

  def add_decoration_to_a_mapping_item
    @renderer = Renderer.find params[:id]
    @position = params[:position].to_i
    @mapping = @renderer.get_mappings[@position]
    @item = @mapping.get_item_for_placeholder_if_exists_or_create_it params[:placeholder]
    # Creo la nuova decoration non valida, ovvero senza parametri
    @decoration = @item.add_decoration params[:decoration_class].constantize.new
    @decoration_position = (@item.decorations.size - 1)
    # Aggiorno il mapping
    @renderer.mappings[@position] = @mapping.dump
    @renderer.save
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)
UPDATE `renderers` SET `mappings` = '--- \n- :items: \n - :input: ufff\n :decorations: \n - :input: \n :class: RenderManager::MappingManager::Truncator\n :params: {}\n\n :placeholder: username\n - :input: \"\"\n :decorations: []\n\n :placeholder: titolo\n :template: <div class=\"titolo\">{username} {titolo}</div>\n- :items: \n - :input: \"\"\n :decorations: []\n\n :placeholder: paragrafo\n :template: <p>{paragrafo}</p>\n' WHERE `id` = 1

  def update_decoration_for_a_mapping_item
    @renderer = Renderer.find params[:id]
    @position = params[:position].to_i
    @mapping = @renderer.get_mappings[@position]
    @item = @mapping.item_for params[:placeholder]
    # Creo la nuova decoration non valida, ovvero senza parametri
    @decoration_position = params[:decoration_position].to_i
    # Salva i valori della decoration
    @item.decorations.each_with_index do |decoration, decoration_position|
      if @decoration_position == decoration_position
        decoration.params_definition.each {|arg| decoration.params[arg] = params[arg]}
      end
    end
    @decoration = @item.decorations[@decoration_position]
    # Aggiorno il mapping
    @renderer.mappings[@position] = @mapping.dump
    @renderer.save
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)
UPDATE `renderers` SET `mappings` = '--- \n- :items: \n - :input: eccolo\n :decorations: \n - :input: \n :class: RenderManager::MappingManager::Truncator\n :params: \n :limit: \"21\"\n - :input: \n :class: RenderManager::MappingManager::DateFormatter\n :params: {}\n\n - :input: \n :class: RenderManager::MappingManager::Simple\n :params: {}\n\n :placeholder: username\n - :input: \"\"\n :decorations: \n - :input: \n :class: RenderManager::MappingManager::Truncator\n :params: {}\n\n :placeholder: titolino\n :template: <div class=\"titolo\">{username} {titolino}</div>\n- :items: \n - :input: \"\"\n :decorations: []\n\n :placeholder: paragrafo\n :template: <p>{paragrafo}</p>\n' WHERE `id` = 1

  def delete_decoration_from_a_mapping_item
    @renderer = Renderer.find params[:id]
    @position = params[:position].to_i
    @mapping = @renderer.get_mappings[@position]
    @item = @mapping.item_for params[:placeholder]
    @decoration_position = params[:decoration_position].to_i
    @item.remove_decoration_at @decoration_position unless @item.nil?
    @renderer.mappings[@position] = @mapping.dump
    @renderer.save
---
SELECT * FROM `renderers` WHERE (`renderers`.`id` = 1)
UPDATE `renderers` SET `mappings` = '--- \n- :items: \n - :input: sdf\n :decorations: \n - :input: \n :class: RenderManager::MappingManager::Simple\n :params: {}\n\n :placeholder: titolino\n - :input: \"\"\n :decorations: []\n\n :placeholder: anno\n :template: |\n <div class=\"titolo\">{titolino} {anno}</div>\n\n- :items: \n - :input: \"\"\n :decorations: []\n\n :placeholder: paragrafo\n :template: <p>{paragrafo}</p>\n' WHERE `id` = 1